"use strict"
const TelegramApi = require('node-telegram-bot-api');
const token = "5087366681:AAE3VxN6XCDfoBIUnX57krtrEE7gIxpFmsQ";
const bot = new TelegramApi(token, { polling: true });

bot.setMyCommands([
    { command: '/infl', description: 'Вплив масок' },
    { command: '/comp', description: 'Склад масок' },
    { command: '/amou', description: 'Зменшення к-сті масок' },
    { command: '/desi', description: 'Дезінфекція масок' },
    { command: '/used', description: 'Використані маски' }
]);

let desinfector =
    `Методи дезінфекції масок:
1)Після використання маски поміщаємо її в карантин на 5 днів, а потім прасуємо її (або гріємо у мікрохвильовці). 
2)Після використання маски поміщаємо її в карантин на 5 днів Після цього перемо її. Коли маска висохне, її можна використовувати повторно.
3)Після використання маски дезінфікувати її за допомогою антисептика.`;

let inful =
    `Негативний вплив масок:
1)Довгий період біологічного розкладання (450 років).
2)Велика кількість медичних масок може утворювати «сітки», в яких тварини можуть заплутатись.
3)Тварини можуть сприйняти маски, як їжу.
4)Виділення токсичних речовин та утворення мікропластику під час розкладання чи спалювання.
5)У водному середовищі, водорості і бактерії можуть обростати на масках, утворюючи агломерати.
6)На поверхні маски можуть перебувати віруси.`;

let compose =
    `Склад медичної маски:
1)Захисна тканина (кілька шарів спандбонду і мельтблауну)
2)Металевий дріт
3)Прогумовані тримаючі лямки.`;

let descreasement =
    `Як зменшити кількість використаних масок:
1)Зменшити тривалість використання масок.
2)Вакцинуватись для вироблення колективного імунітету країни, щоб протистояти вірусу covid-19.
3)Дезінфікувати маски за допомогою ультрафіолетового світла.
4)Використовувати багаторазові маски замість одноразових.
5)Розробка нових технологій для створення масок, що легко утилізуються.`;

let usedM =
    `Що робити з використаними масками:
1)У жодному разі не спалюйте і не викидайте їх у смітник разом із звичайним сміттям.
2)Поцікавтесь щодо пунктів збору медичних масок у вашому регіоні (місті чи районному центрі). 
  Зазвичай великі мережі супермаркетів та аптек збирають маски для переробки.
3)Віднесіть використані маски до одного із пумктів збору.
4)Будьте впевнені, потім ваші маски будуть направлені на підприємства із переробки сміття.`;

bot.on('message', async msg => {
    const text = msg.text;
    const chatId = msg.chat.id;
    switch (text) {
        case '/start':
            await bot.sendMessage(chatId, 'Доброго дня! За допомогою цього бота ви можете дізнатися певну інформацію щодо медичних масок. Будь ласка оберіть команду з меню.')
            break;

        case '/desi':
            await bot.sendMessage(chatId, desinfector)
            break;

        case '/infl':
            await bot.sendMessage(chatId, inful)
            break;

        case '/comp':
            await bot.sendMessage(chatId, compose)
            break;

        case '/amou':
            await bot.sendMessage(chatId, descreasement)
            break;

        case '/used':
            await bot.sendMessage(chatId, usedM)
            break;

        default:
            bot.sendMessage(chatId, 'Ви ввели неправильну команду. Виберіть команду із списку меню!')
            break;
    }
});